{
  "start room": {
    "description": "You are in the Main Hub of the escape game. In front of you are three doors:\n1) Server Room\n2) Chemical Room\n3) Teaching Lab\nChoose one door to enter.",
    "choice": {
      "1": "Server Room",
      "2": "Chemical Room",
      "3": "Teaching Lab"
    }
  },

  "rooms": {
     "Server Room": {
      "description": "You enter a room labelled 'Server Room'. The shelves are lined with various chemicals and lab equipment.",
      "directions": "\nChoose which direction to go:\n1) Left\n2) Forward\n3) Right",
      "choice": {
        "1": {
          "text": "To your left is a desk with a computer. The computer is turned OFF.\nMaybe you need to plug in one of the cables you saw elsewhere to power it on.\nFor now, nothing happens when you press the keys."
        },
        "2": {
          "text": "Ahead of you is a heavy metal door. Above it, a flickering sign reads 'EXIT'.\nThe door is firmly locked. It looks like something else in the room might control it."
        },
        "3": {
          "text": "To your right you see three cables hanging from the wall: RED, YELLOW, and GREEN.\nYou can try plugging one of them into the nearby power socket.\n1) Plug in the RED cable\n2) Plug in the YELLOW cable\n3) Plug in the GREEN cable",
          "choice": {
            "1": {
              "text": "You plug in the RED cable. The computer on the left whirs to life and the monitor flickers on.\nOn the screen you see a prompt: 'ENTER PASSWORD (4 letters)'.\n1) Enter the 4-letter password:\n2) Return",
              "choice": {
                  "1": {
                      "type": "puzzle",
                      "text": "Enter password: ",
                      "code": "EXIT",
                      "success": "Correct! The computer beeps and you hear a loud click from the EXIT door.\nThe door swings open and you step through to the next area.",
                      "fail": "Incorrect password. The screen flashes red for a moment.\n1) Try again?\n2) Go back"
                  },
                  "2": {
                      "text": "You step away from the screen and go back to the entrance of the room."
                  }
 
              }
            },
            "2": {
              "type": "",
              "text": "You plug in the YELLOW cable. Nothing happens. The room stays dark and the computer stays OFF."
            },
            "3": {
              "type": "",
              "text": "You plug in the GREEN cable. Sparks explode from the socket and you jump back in shock.\nThat was definitely not the right cable. Maybe try another one."
            }
          }
        }
      },
      "hint": "The EXIT sign might be more important than it looks."
    },

    
    "chemical room": {
      "description": "You chose the room labelled 'chemical control room'. There are three different options that you can see that might lead to an exit.",
      "choices": {
       "1": {
         "text": "You see a set of lockers that have names of staff on them. They do not seem to be unlocked; however, you wonder if you can open them either way.",
         "outcome": {
           "text": "You pull the doors of all the lockers. Only one opens with a key-card in it; it seems that it may open the exit."
         }
       },
       "2": {
         "text": "You see an acid cupboard. It has a lock on it and seems to need a key to be opened.",
         "outcome": {
           "text": "You go up to the acid cupboard. It will not open without a key.",
           "force": "You pull the door open. All but one vial of acid breaks; you take the one vial.",
           "key": "You look for a key but it does not seem to be in the room."
         }
       },
       "3": {
         "text": "You see a desk that looks like it belonged to a researcher. You think that you can check the desk for anything useful.",
         "outcome": {
           "text": "You check the drawers of the desk; however, it does not seem to have anything of value."
           }
       }
      }
    },
    "hint": "There are multiple different ways of leaving this room."
  },

    "Teaching Lab": {
        "description": "You enter an abandoned teaching lab. Benches are covered in dusty equipment, and the room feels creepily quiet. \nChoose which direction to go:\n1) Left\n2) Forward\n3) Right",
        "choice": {
            "1": {
                "text": "To your left is a large board covered in equations and diagrams.\nMost of it is smudged and outdated.\nNear the corner, one sequence of numbers is circled repeatedly:\n'3142'\nIt looks deliberately highlighted, as if meant to be remembered."
            },
            "2": {
                "text": "Straight ahead is a small room secured by a keypad.\nA note above it reads: 'AUTHORIZED STAFF ONLY'.\nThe keypad is active, but it requires a passcode."
            },
            "3": {
                "text": "To your right is the teacher’s computer sitting on a desk.\nThe screen is on, but it’s locked behind a 4-digit passcode.\n1) Try to unlock the computer?\n2) Step away from the computer.",
                "choice": {
                    "1": {
                        "type": "puzzle",
                        "text": "Enter the 4-digit computer passcode:",
                        "code": "3142",
                        "success": "Correct! The computer unlocks.\nOn the desktop, a file labeled 'Keypad Code' is immediately visible.\nInside is a note reading: 'Keypad Passcode: 7295'.",
                        "fail": "Incorrect passcode. The computer remains locked."
                    },
                    "2": {
                        "text": "You step away from the computer. The screen stays lit, waiting."
                    }
                }
            }
        },
        "hint": "There may be multiple passcodes that need to be found."
    },

    "Research Lab": {
      "description": "You enter a room labelled 'Research Lab' and see scientific equipment scattered across the room.",
      "directions": "\nChoose which direction to go:\n1) Left\n2) Forward\n3) Right",
      "choice": {
        "1": {
          "text": "To your left is a desk with a microscope.\nYou decide to look in the microscope. Through the lens you see four numbers in different colours:\nGreen: 6\nBlue: 4\nRed: 8\nYellow: 9\n*Note added to inventory",
          "item": "Note:\nGreen: 6\nBlue: 4\nRed: 8\nYellow: 9"
        },
        "2": {
          "text": "Ahead of you is a table with testing equipment.\nOn the table there are a series of test tubes lined up which contain red, green, blue, and yellow liquids."
        },
        "3": {
          "text": "To your right is another door.\nThe door is locked.\nThere is a keypad which requires a 4-digit code to unlock it...\n1) Enter the code?\n2) Go back",
          "choice": {
            "1": {
              "type": "puzzle",
              "text": "Enter the code: ",
              "code": "8649",
              "success": "Correct!",
              "fail": "Incorrect passcode.\n1) Try again?\n2) Go back"
            },
            "2": {
              "text": "You are back at the entrance to the room."
            }
          }
        }
      },
      "hint": "Look carefully at the colours of the test tubes."
    },

    //Analytic Lab

  }
}

 

  