{
  "start room": {
    "description": "You are in the Main Hub of the escape game. In front of you are three doors:\n1) Server Room\n2) Chemical Room\n3) Teaching Lab\nChoose one door to enter.",
    "choice": {
      "1": "Server Room",
      "2": "Chemical Room",
      "3": "Teaching Lab"
    }
  },

  "rooms": {
    "Server Room": {
      "description": "You enter a room labelled 'Server Room'. The walls are lined with server racks and blinking lights.",
      "directions": "\nChoose which direction to go:\n1) Left\n2) Forward\n3) Right",
      "choice": {
        "1": {
          "text": "To your left is a desk with a computer. The computer is turned OFF.\nMaybe you need to plug in one of the cables you saw elsewhere to power it on.\nFor now, nothing happens when you press the keys."
        },
        "2": {
          "text": "Ahead of you is a heavy metal door. Above it, a flickering sign reads 'EXIT'.\nThe door is firmly locked. It looks like something else in the room might control it."
        },
        "3": {
          "text": "To your right you see three cables hanging from the wall: RED, YELLOW, and GREEN.\nYou can try plugging one of them into the nearby power socket.\n1) Plug in the RED cable\n2) Plug in the YELLOW cable\n3) Plug in the GREEN cable",
          "choice": {
            "1": {
              "type": "puzzle",
              "text": "You plug in the RED cable. The computer on the left whirs to life and the monitor flickers on.\nOn the screen you see a prompt: 'ENTER PASSWORD (4 letters)'.\nEnter the 4-letter password:",
              "code": "EXIT",
              "success": "Correct! The computer beeps and you hear a loud click from the EXIT door.\nThe door swings open and you step through to the next area.",
              "fail": "Incorrect password. The screen flashes red for a moment, then returns to the prompt."
            },
            "2": {
              "type": "",
              "text": "You plug in the YELLOW cable. Nothing happens. The room stays dark and the computer stays OFF."
            },
            "3": {
              "type": "",
              "text": "You plug in the GREEN cable. Sparks explode from the socket and you jump back in shock.\nThat was definitely not the right cable. Maybe try another one."
            }
          }
        }
      },
      "hint": "The EXIT sign might be more important than it looks."
    },

    //Chemical Storage

    //Teaching Lab

    "Research Lab": {
      "description": "You enter a room labelled 'Research Lab' and see scientific equipment scattered across the room.",
      "directions": "\nChoose which direction to go:\n1) Left\n2) Forward\n3) Right",
      "choice": {
        "1": {
          "text": "To your left is a desk with a microscope.\nYou decide to look in the microscope. Through the lens you see four numbers in different colours:\nGreen: 6\nBlue: 4\nRed: 8\nYellow: 9\n*Note added to inventory",
          "item": "Note:\nGreen: 6\nBlue: 4\nRed: 8\nYellow: 9"
        },
        "2": {
          "text": "Ahead of you is a table with testing equipment.\nOn the table there are a series of test tubes lined up which contain red, green, blue, and yellow liquids."
        },
        "3": {
          "text": "To your right is another door.\nThe door is locked.\nThere is a keypad which requires a 4-digit code to unlock it...\n1) Enter the code?\n2) Go back",
          "choice": {
            "1": {
              "type": "puzzle",
              "text": "Enter the code: ",
              "code": "8649",
              "success": "Correct!",
              "fail": "Incorrect passcode.\n1) Try again?\n2) Go back"
            },
            "2": {
              "text": "You are back at the entrance to the room."
            }
          }
        }
      },
      "hint": "Look carefully at the colours of the test tubes."
    },

    //Analytic Lab

  }
}

 

  